using Tyuiu.YushkovAI.Sprint1.Task0.V4.Lib;
namespace Tyuiu.YushkovAI.Sprint1.Task0.V4;
    internal class Program
    {
        static void Main(string[] args)
        {
            DataService ds = new DataService();

            Console.Title = "Спринт #1 | Выполнил: Гойтиев Т. К. | ПКТб-26-1";
            Console.WriteLine("********************************************************************************************************");
            Console.WriteLine("* Спринт #1                                                                                            *");
            Console.WriteLine("* Тема: Базовые навыки работы в C#                                                                     *");
            Console.WriteLine("* Задание #0                                                                                           *");
            Console.WriteLine("* Вариант #4                                                                                           *");
            Console.WriteLine("* Выполнил: Юшков Антон Ильич | ПКТБ-26-1                                                              *");
            Console.WriteLine("********************************************************************************************************");
            Console.WriteLine("* УСЛОВИЕ:                                                                                             *");
            Console.WriteLine("* Написать программу, которая вычисляет выражение 4/2*5/(3+2)*(5-2) и печатает результат на эк         *");
            Console.WriteLine("* ране.                                                                                                *");
            Console.WriteLine("********************************************************************************************************");
        
      

            Console.WriteLine("********************************************************************************************************");
            Console.WriteLine("********************************************************************************************************");
            Console.WriteLine($"* РЕЗУЛЬТАТ: {ds.Calculate()}                                                                                         *");
            Console.WriteLine("********************************************************************************************************");
            
        }
    }

